In [ ]:
#join funtions

In [50]:
import pandas as pd
var1=pd.DataFrame({'name': ['John', 'Alice', 'Bob'], 'age': [25, 26,27]})
var2=pd.DataFrame({'names': ['Alice', 'Bob', 'Char   '], 'roll no': [12, 14, 16]})
var2.join(var1)

     names  roll no   name  age
0    Alice       12   John   25
1      Bob       14  Alice   26
2  Char          16    Bob   27

In [51]:
# showing common values
var1.join(var2,how='inner')

    name  age    names  roll no
0   John   25    Alice       12
1  Alice   26      Bob       14
2    Bob   27  Char          16

In [53]:
#showing all values
var2.join(var1,how='outer',)

     names  roll no   name  age
0    Alice       12   John   25
1      Bob       14  Alice   26
2  Char          16    Bob   27